sle118/squeezelite-esp32/components/squeezelite/output_i2s.c
        if (jack_mutes_amp != (pkt->config == 0)) {
            jack_mutes_amp = pkt->config == 0;
            platform->dev.dac.jack_mutes_amp = jack_mutes_amp;
            config_raise_changed(false);

            if (jack_mutes_amp && jack_inserted_svc()) {
                adac->speaker(false);
                if (amp_control.gpio != -1) gpio_set_level_x(amp_control.gpio, !amp_control.active);
            } else {
                adac->speaker(true);
                if (amp_control.gpio != -1) gpio_set_level_x(amp_control.gpio, amp_control.active);
            }
        }

        LOG_INFO("got AUDO %02x", pkt->config);
    } else {
        res = false;
    }

    // chain protocol handlers (bitwise or is fine)
    if (*slimp_handler_chain) res |= (*slimp_handler_chain)(data, len);

    return res;
}

/****************************************************************************************
 * jack insertion handler
 */
static void jack_handler(bool inserted) {
    // jack detection bounces a bit but that seems fine
    if (jack_mutes_amp) {
        LOG_INFO("switching amplifier %s", inserted ? "OFF" : "ON");
        adac->speaker(!inserted);
        if (amp_control.gpio != -1) gpio_set_level_x(amp_control.gpio, inserted ? !amp_control.active : amp_control.active);
    }

    // activate headset
    adac->headset(inserted);

    // and chain if any
    if (jack_handler_chain) (jack_handler_chain)(inserted);
}

/****************************************************************************************
 * Get inactivity callback
 */
static uint32_t i2s_idle_callback(void) { return output.state <= OUTPUT_STOPPED ? pdTICKS_TO_MS(xTaskGetTickCount()) - i2s_idle_since : 0; }

/****************************************************************************************
 * Initialize the DAC output
 */
void output_init_i2s() {
    int silent_do = -1;
    LOG_DEBUG("Initializing I2S output");
    config = get_profile(NULL);
    sys_dac_config* dac_config = platform->has_dev && platform->dev.has_dac ? &platform->dev.dac : NULL;
    sys_dev_spdif* spdif_config = platform->has_dev && platform->dev.has_spdif ? &platform->dev.spdif : NULL;
    loglevel = log_level_from_sys_level(config->log.output);
    esp_err_t res;

    // chain SLIMP handlers
    slimp_handler_chain = slimp_handler;
    slimp_handler = handler;
    if (dac_config) jack_mutes_amp = dac_config->jack_mutes_amp;
    if (platform->has_gpios) {
        amp_control.gpio = platform->has_gpios && platform->gpios.has_amp ? platform->gpios.amp.pin : -1;
        amp_control.active = platform->has_gpios && platform->gpios.has_amp ? platform->gpios.amp.level : 0;
    }

#if BYTES_PER_FRAME == 8
    output.format = S32_LE;
#else
    output.format = S16_LE;
#endif

    output.write_cb = &_i2s_write_frames;

    obuf = malloc(FRAME_BLOCK * BYTES_PER_FRAME);
    if (!obuf) {
        LOG_ERROR("Cannot allocate i2s buffer");
        return;
    }

    running = true;

    i2s_pin_config_t i2s_dac_pin = {-1, -1, -1, -1, -1}, i2s_spdif_pin = {-1, -1, -1, -1, -1};
    if (dac_config) {
        i2s_dac_pin.bck_io_num = dac_config->bck;
        i2s_dac_pin.data_out_num = dac_config->dout;
        i2s_dac_pin.ws_io_num = dac_config->ws;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 4, 0)
        if (dac_config->mck != sys_dac_mck_NONE && dac_config->mck != sys_dac_mck_INVALID1) {
            LOG_INFO("Using I2S Master clock %s", sys_dac_mck_name(dac_config->mck));
            i2s_dac_pin.mck_io_num = dac_config->mck - sys_dac_mck_GPIO0;
        } else {
            LOG_INFO("Configuration does not specify an I2S Master Clock");
            i2s_dac_pin.mck_io_num = -1;
        }
#endif
    }
    if (spdif_config) {
        i2s_spdif_pin.bck_io_num = spdif_config->clk;
        i2s_spdif_pin.data_out_num = spdif_config->data;
        i2s_spdif_pin.ws_io_num = spdif_config->ws;
    }

    if (i2s_dac_pin.data_out_num == -1 && i2s_spdif_pin.data_out_num == -1) {
        LOG_WARN("DAC and SPDIF not configured, NOT launching i2s thread");
        return;
    }

    // common I2S initialization
    i2s_config.mode = I2S_MODE_MASTER | I2S_MODE_TX;
    i2s_config.channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT;
    i2s_config.communication_format = I2S_COMM_FORMAT_STAND_I2S;
    // in case of overflow, do not replay old buffer
    i2s_config.tx_desc_auto_clear = true;
#ifndef CONFIG_IDF_TARGET_ESP32S3
    i2s_config.use_apll = true;
#endif
    i2s_config.intr_alloc_flags = ESP_INTR_FLAG_LEVEL1; // Interrupt level 1
    i2s_config.dma_buf_len = DMA_BUF_FRAMES;
    i2s_config.dma_buf_count = DMA_BUF_COUNT;

    if (config->output_type == sys_squeezelite_outputs_SPDIF) {
        spdif.enabled = true;
        LOG_DEBUG("Configuring SPDIF");
        if ((spdif.buf = heap_caps_malloc(SPDIF_BLOCK * 16, MALLOC_CAP_INTERNAL)) == NULL) {
            LOG_ERROR("Cannot allocate SPDIF buffer");
        }

        if (i2s_spdif_pin.bck_io_num == -1 || i2s_spdif_pin.ws_io_num == -1 || i2s_spdif_pin.data_out_num == -1) {
            LOG_WARN(
                "Cannot initialize I2S for SPDIF bck:%d ws:%d do:%d", i2s_spdif_pin.bck_io_num, i2s_spdif_pin.ws_io_num, i2s_spdif_pin.data_out_num);
        }

        i2s_config.sample_rate = output.current_sample_rate * 2;
        i2s_config.bits_per_sample = 32;
        // Normally counted in frames, but 16 sample are transformed into 32 bits in spdif
        i2s_config.dma_buf_len = DMA_BUF_FRAMES_SPDIF;
        i2s_config.dma_buf_count = DMA_BUF_COUNT_SPDIF;
        /*
           In DMA, we have room for (LEN * COUNT) frames of 32 bits samples that
           we push at sample_rate * 2. Each of these pseudo-frames is a single true
           audio frame. So the real depth in true frames is (LEN * COUNT / 2)
        */
        dma_buf_frames = i2s_config.dma_buf_len * i2s_config.dma_buf_count / 2;

        // silence DAC output if sharing the same ws/bck
        if (i2s_dac_pin.ws_io_num == i2s_spdif_pin.ws_io_num && i2s_dac_pin.bck_io_num == i2s_spdif_pin.bck_io_num)
            silent_do = i2s_dac_pin.data_out_num;

        res = i2s_driver_install(CONFIG_I2S_NUM, &i2s_config, 0, NULL);
        res |= i2s_set_pin(CONFIG_I2S_NUM, &i2s_spdif_pin);
        LOG_INFO("SPDIF using I2S bck:%d, ws:%d, do:%d", i2s_spdif_pin.bck_io_num, i2s_spdif_pin.ws_io_num, i2s_spdif_pin.data_out_num);
    } else {
        LOG_DEBUG("Configuring DAC");
        i2s_config.sample_rate = output.current_sample_rate;
        i2s_config.bits_per_sample = BYTES_PER_FRAME * 8 / 2;
        // Counted in frames (but i2s allocates a buffer <= 4092 bytes)
        i2s_config.dma_buf_len = DMA_BUF_FRAMES;
        i2s_config.dma_buf_count = DMA_BUF_COUNT;
        dma_buf_frames = i2s_config.dma_buf_len * i2s_config.dma_buf_count;

        // silence SPDIF output
        silent_do = i2s_spdif_pin.data_out_num;
        mute_control.gpio = dac_config && dac_config->has_mute ? dac_config->mute.pin : -1;
        mute_control.active = dac_config && dac_config->has_mute ? dac_config->mute.level : 0;
        bool mck_required = false;
        LOG_DEBUG("Looking for %s DAC Driver", sys_dac_models_name(dac_config->model));
        for (int i = 0; adac == &dac_external && dac_set[i]; i++) {
            if (dac_set[i]->model == dac_config->model) {
                LOG_DEBUG("Found Driver");
                adac = dac_set[i];
            } else {
                LOG_DEBUG("Skipping %s", sys_dac_models_name(dac_set[i]->model));
            }
        }
        if (!adac) {
            LOG_ERROR("Invalid adac structure");
            return;
        }
        if (!adac->init) {
            LOG_ERROR("adac doesn't have a valid init");
            return;
        }
        LOG_DEBUG("Calling DAC init for %s", sys_dac_models_name(adac->model));
        res = adac->init(&platform->dev.dac, &i2s_config, &mck_required) ? ESP_OK : ESP_FAIL;
#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(4, 4, 0)
        int mck_io_num = (((int)dac_config->mck) - ((int)sys_MCKEnum_MCK0)) < 0 && mck_required ? 0
                         : mck_required                                                         ? dac_config->mck - sys_MCKEnum_MCK0
                                                                                                : -1;
        LOG_INFO("configuring MCLK on GPIO %d", mck_io_num);
        if (mck_io_num == GPIO_NUM_0) {
            PIN_FUNC_SELECT(PERIPHS_IO_MUX_GPIO0_U, FUNC_GPIO0_CLK_OUT1);
            WRITE_PERI_REG(PIN_CTRL, CONFIG_I2S_NUM == I2S_NUM_0 ? 0xFFF0 : 0xFFFF);
        } else if (mck_io_num == GPIO_NUM_1) {
            PIN_FUNC_SELECT(PERIPHS_IO_MUX_U0TXD_U, FUNC_U0TXD_CLK_OUT3);
            WRITE_PERI_REG(PIN_CTRL, CONFIG_I2S_NUM == I2S_NUM_0 ? 0xF0F0 : 0xF0FF);
        } else if (mck_io_num == GPIO_NUM_2) {
            PIN_FUNC_SELECT(PERIPHS_IO_MUX_U0RXD_U, FUNC_U0RXD_CLK_OUT2);
            WRITE_PERI_REG(PIN_CTRL, CONFIG_I2S_NUM == I2S_NUM_0 ? 0xFF00 : 0xFF0F);
        } else {
            LOG_WARN("invalid MCK gpio %d", mck_io_num);
        }
#else
        if (res == ESP_OK) {
            if (mck_required && i2s_dac_pin.mck_io_num == -1) {
                LOG_DEBUG("Defaulting MCLK on GPIO %d", i2s_dac_pin.mck_io_num);
                i2s_dac_pin.mck_io_num = 0;
            } else {
                LOG_DEBUG("MCLK configured on GPIO %d", i2s_dac_pin.mck_io_num);
            }
        }
#endif
        if (res == ESP_OK) {
            res |= i2s_driver_install(CONFIG_I2S_NUM, &i2s_config, 0, NULL);
            res |= i2s_set_pin(CONFIG_I2S_NUM, &i2s_dac_pin);

            if (res == ESP_OK && mute_control.gpio >= 0) {
                esp_rom_gpio_pad_select_gpio(mute_control.gpio);
                gpio_set_direction(mute_control.gpio, GPIO_MODE_OUTPUT);
                gpio_set_level(mute_control.gpio, mute_control.active);
            }

