sle118/squeezelite-esp32/components/squeezelite/output_i2s.c
            LOG_INFO("%s DAC using I2S bck:%d, ws:%d, do:%d, mute:%d:%d (res:%d)", sys_dac_models_name(dac_config->model), i2s_dac_pin.bck_io_num,
                i2s_dac_pin.ws_io_num, i2s_dac_pin.data_out_num, mute_control.gpio, mute_control.active, res);
        }
    }

    if (res != ESP_OK) {
        LOG_WARN("no DAC configured");
        return;
    }

    // turn off GPIO than is not used (SPDIF of DAC DO when shared)
    if (silent_do >= 0) {
        esp_rom_gpio_pad_select_gpio(silent_do);
        gpio_set_direction(silent_do, GPIO_MODE_OUTPUT);
        gpio_set_level(silent_do, 0);
    }

    LOG_INFO("Initializing I2S mode %s with rate: %d, bits per sample: %d, buffer frames: %d, "
             "number of buffers: %d ",
        spdif.enabled ? "S/PDIF" : "normal", i2s_config.sample_rate, i2s_config.bits_per_sample, i2s_config.dma_buf_len, i2s_config.dma_buf_count);

    i2s_stop(CONFIG_I2S_NUM);
    i2s_zero_dma_buffer(CONFIG_I2S_NUM);
    isI2SStarted = false;

    equalizer_set_samplerate(output.current_sample_rate);

    adac->power(ADAC_STANDBY);

    jack_handler_chain = jack_handler_svc;
    jack_handler_svc = jack_handler;
    if (amp_control.gpio != -1) {
        gpio_pad_select_gpio_x(amp_control.gpio);
        gpio_set_direction_x(amp_control.gpio, GPIO_MODE_OUTPUT);
        gpio_set_level_x(amp_control.gpio, !amp_control.active);
        LOG_INFO("setting amplifier GPIO %d (active:%d)", amp_control.gpio, amp_control.active);
    }

    if (jack_mutes_amp && jack_inserted_svc())
        adac->speaker(false);
    else
        adac->speaker(true);

    adac->headset(jack_inserted_svc());

    // do we want stats
    if (platform->has_services && platform->services.statistics) {
        pseudo_idle_chain = pseudo_idle_svc;
        pseudo_idle_svc = i2s_stats;
    }

    // register a callback for inactivity
    i2s_idle_since = pdTICKS_TO_MS(xTaskGetTickCount());
    services_sleep_setsleeper(i2s_idle_callback);

    // create task as a FreeRTOS task but uses stack in internal RAM
    {
        static DRAM_ATTR StaticTask_t xTaskBuffer __attribute__((aligned(4)));
        static EXT_RAM_ATTR StackType_t xStack[OUTPUT_THREAD_STACK_SIZE] __attribute__((aligned(4)));
        output_i2s_task = xTaskCreateStaticPinnedToCore((TaskFunction_t)output_thread_i2s, "output_i2s", OUTPUT_THREAD_STACK_SIZE, NULL,
            CONFIG_ESP32_PTHREAD_TASK_PRIO_DEFAULT + 1, xStack, &xTaskBuffer, 0);
    }
}

/****************************************************************************************
 * Terminate DAC output
 */
void output_close_i2s(void) {
    LOCK;
    running = false;
    UNLOCK;

    while (!ended)
        vTaskDelay(20 / portTICK_PERIOD_MS);

    i2s_driver_uninstall(CONFIG_I2S_NUM);
    free(obuf);

    equalizer_close();

    adac->deinit();
}

/****************************************************************************************
 * change volume
 */
bool output_volume_i2s(unsigned left, unsigned right) {
    if (mute_control.gpio >= 0) gpio_set_level(mute_control.gpio, (left | right) ? !mute_control.active : mute_control.active);
    return adac->volume(left, right);
}

/****************************************************************************************
 * Write frames to the output buffer
 */
static int _i2s_write_frames(
    frames_t out_frames, bool silence, s32_t gainL, s32_t gainR, u8_t flags, s32_t cross_gain_in, s32_t cross_gain_out, ISAMPLE_T** cross_ptr) {
    if (!silence) {
        if (output.fade == FADE_ACTIVE && output.fade_dir == FADE_CROSS && *cross_ptr) {
            _apply_cross(outputbuf, out_frames, cross_gain_in, cross_gain_out, cross_ptr);
        }

        _apply_gain(outputbuf, out_frames, gainL, gainR, flags);
        memcpy(obuf + oframes * BYTES_PER_FRAME, outputbuf->readp, out_frames * BYTES_PER_FRAME);
    } else {
        memcpy(obuf + oframes * BYTES_PER_FRAME, silencebuf, out_frames * BYTES_PER_FRAME);
    }

    // don't update visu if we don't have enough data in buffer
    if (silence || output.external || _buf_used(outputbuf) > outputbuf->size >> 2) {
        output_visu_export(obuf + oframes * BYTES_PER_FRAME, out_frames, output.current_sample_rate, silence, (gainL + gainR) / 2);
    }

    oframes += out_frames;

    return out_frames;
}

/****************************************************************************************
 * Main output thread
 */
static void output_thread_i2s(void* arg) {
    size_t bytes;
    frames_t iframes = FRAME_BLOCK;
    uint32_t timer_start = 0;
    int discard = 0;
    uint32_t fullness = gettime_ms();
    bool synced;
    output_state state = OUTPUT_OFF - 1;

    while (running) {

        TIME_MEASUREMENT_START(timer_start);

        LOCK;

        // manage led display & analogue
        if (state != output.state) {
            LOG_INFO("Output state is %d", output.state);
            if (output.state == OUTPUT_OFF) {
                led_blink(LED_GREEN, 100, 2500);
                if (amp_control.gpio != -1) gpio_set_level_x(amp_control.gpio, !amp_control.active);
                LOG_INFO("switching off amp GPIO %d", amp_control.gpio);
            } else if (output.state == OUTPUT_STOPPED) {
                i2s_idle_since = pdTICKS_TO_MS(xTaskGetTickCount());
                adac->speaker(false);
                led_blink(LED_GREEN, 200, 1000);
            } else if (output.state == OUTPUT_RUNNING) {
                if (!jack_mutes_amp || !jack_inserted_svc()) {
                    if (amp_control.gpio != -1) gpio_set_level_x(amp_control.gpio, amp_control.active);
                    adac->speaker(true);
                }
                led_on(LED_GREEN);
            }
        }
        state = output.state;

        if (output.state == OUTPUT_OFF) {
            UNLOCK;
            if (isI2SStarted) {
                isI2SStarted = false;
                i2s_stop(CONFIG_I2S_NUM);
                adac->power(ADAC_STANDBY);
            }
            usleep(100000);
            continue;
        } else if (output.state == OUTPUT_STOPPED) {
            synced = false;
        }

        oframes = 0;
        output.updated = gettime_ms();
        output.frames_played_dmp = output.frames_played;
        // try to estimate how much we have consumed from the DMA buffer (calculation is incorrect
        // at the very beginning ...)
        output.device_frames = dma_buf_frames - ((output.updated - fullness) * output.current_sample_rate) / 1000;
        // we'll try to produce iframes if we have any, but we might return less if outpuf does not
        // have enough
        _output_frames(iframes);
        // oframes must be a global updated by the write callback
        output.frames_in_process = oframes;

        SET_MIN_MAX_SIZED(oframes, rec, iframes);
        SET_MIN_MAX_SIZED(_buf_used(outputbuf), o, outputbuf->size);
        SET_MIN_MAX_SIZED(_buf_used(streambuf), s, streambuf->size);
        SET_MIN_MAX(TIME_MEASUREMENT_GET(timer_start), buffering);

        /* must skip first whatever is in the pipe (but not when resuming).
        This test is incorrect when we pause a track that has just started,
        but this is higly unlikely and I don't have a better one for now */
        if (output.state == OUTPUT_START_AT) {
            discard = output.frames_played_dmp ? 0 : output.device_frames;
            synced = true;
        } else if (discard) {
            discard -= min(oframes, discard);
            iframes = discard ? min(FRAME_BLOCK, discard) : FRAME_BLOCK;
            UNLOCK;
            continue;
        }

        UNLOCK;

